package com.jzfq.rms.third.common.enums;

/**
 * 反欺诈规则枚举
 * @author 大连桔子分期科技有限公司
 * @date  2017/3/14. 上午10:14:14
 */
public enum FqzRuleEnum {

    FQZ_RULE_1(1,"申请人与其他申请人，手机号相同，身份证不同"),
    FQZ_RULE_2(2,"申请人与其他申请人，第一联系人，手机号相同，姓名不同"),
    FQZ_RULE_3(3,"申请人与其他申请人，第二联系人，手机号相同，姓名不同"),
    FQZ_RULE_4(4,"申请人与其他申请人，第三联系人，手机号相同，姓名不同"),
    FQZ_RULE_5(5,"申请人与收货人，手机号相同，姓名不同"),
    FQZ_RULE_6(6,"近6个月内，申请人重复下单，手机号不同"),
    FQZ_RULE_7(7,"第一联系人与其他订单联系人，手机号相同，姓名不同"),
    FQZ_RULE_8(8,"第二联系人与其他订单联系人，手机号相同，姓名不同"),
    FQZ_RULE_9(9,"第三联系人与其他订单联系人，手机号相同，姓名不同"),
    FQZ_RULE_10(10,"第一联系人与其他订单申请人，手机号相同，姓名不同"),
    FQZ_RULE_11(11,"第二联系人与其他订单申请人，手机号相同，姓名不同"),
    FQZ_RULE_12(12,"第三联系人与其他订单申请人，手机号相同，姓名不同"),
    FQZ_RULE_13(13,"近6个月内，第一联系人为其他订单联系人，大于或等于3次"),
    FQZ_RULE_14(14,"近6个月内，第二联系人为其他订单联系人，大于或等于3次"),
    FQZ_RULE_15(15,"近6个月内，第三联系人为其他订单联系人，大于或等于3次"),
    FQZ_RULE_16(16,"第一联系人与其他订单联系人，手机号相同，关联订单为虚假类"),
    FQZ_RULE_17(17,"第二联系人与其他订单联系人，手机号相同，关联订单为虚假类"),
    FQZ_RULE_18(18,"第三联系人与其他订单联系人，手机号相同，关联订单为虚假类"),
    FQZ_RULE_19(19,"第一联系人与其他订单联系人，手机号相同，关联订单为欺诈类"),
    FQZ_RULE_20(20,"第二联系人与其他订单联系人，手机号相同，关联订单为欺诈类"),
    FQZ_RULE_21(21,"第三联系人与其他订单联系人，手机号相同，关联订单为欺诈类"),
    FQZ_RULE_22(22,"第二联系人与其他订单第二联系人，手机号相同，申请人工作单位不同"),
    FQZ_RULE_23(23,"申请人与其他申请人，单位电话相同，单位名称不同"),
    FQZ_RULE_24(24,"申请人与其他申请人，单位电话相同，关联订单为虚假类"),
    FQZ_RULE_25(25,"申请人与其他申请人，单位电话相同，关联订单为欺诈类"),
    FQZ_RULE_26(26,"近6个月内，申请人单位电话，出现次数大于或等于10次"),
    FQZ_RULE_27(27,"近6个月内，申请人重复下单，单位名称不同"),
    FQZ_RULE_28(28,"近1天内，同设备，注册3个及以上不同账号"),
    FQZ_RULE_29(29,"近3天内，同设备，注册3个及以上不同账号"),
    FQZ_RULE_30(30,"近7天内，同设备，注册3个及以上不同账号"),
    FQZ_RULE_31(31,"近30天内，同设备，注册3个及以上不同账号"),
    FQZ_RULE_32(32,"近1天内，同设备，登录3个及以上不同账号"),
    FQZ_RULE_33(33,"近3天内，同设备，登录3个及以上不同账号"),
    FQZ_RULE_34(34,"近7天内，同设备，登录3个及以上不同账号"),
    FQZ_RULE_35(35,"近30天内，同设备，登录3个及以上不同账号"),

    /**
     * 分期订单规则
     */
    FQZ_RULE_36(36,"该单为首次下3C类订单，收货地址包含手机、电脑、数码、通讯、通讯器材"),
    FQZ_RULE_37(37,"该单为首次下3C类订单，收货地址与GPS定位地址不属于同一省"),
    FQZ_RULE_38(38,"该单为首次下3C类订单，收货人手机与本人手机不一致"),
    FQZ_RULE_39(39,"该单为首次下3C类订单，收货人手机与历史订单收货人手机相同，收货人姓名不同"),
    FQZ_RULE_40(40,"该单为首次下3C类订单，收货人手机与历史订单收货人手机相同，订单账号不同"),
    FQZ_RULE_41(41,"该订单为3C类订单，且3个月内有其他3C类订单，收货地址包含手机、电脑、数码、通讯、通讯器材"),
    FQZ_RULE_42(42,"该订单为3C类订单，且3个月内有其他3C类订单，收货地址与GPS定位地址不属于同一省"),
    FQZ_RULE_43(43,"该订单为3C类订单，且3个月内有其他3C类订单，收货人手机与本人手机不一致"),
    FQZ_RULE_44(44,"该订单为3C类订单，且3个月内有其他3C类订单，收货人手机与历史订单收货人手机相同，收货人姓名不同"),
    FQZ_RULE_45(45,"该订单为3C类订单，且3个月内有其他3C类订单，收货人手机与历史订单收货人手机相同，订单账号不同"),
    FQZ_RULE_46(46,"历史有被拒绝3个月之内的订单记录"),
    FQZ_RULE_47(47,"该订单为3C类订单，且3个月内有其他3C类订单"),
    FQZ_RULE_48(48,"所购商品，商品名包含iPhone 7、iPhone 7 Plus"),
    FQZ_RULE_49(49,"该单为轻奢侈品类订单，收货地址包含手机、电脑、数码、通讯、通讯器材"),
    FQZ_RULE_50(50,"该单为轻奢侈品类订单，收货地址与GPS定位地址不属于同一省"),
    FQZ_RULE_51(51,"该单为轻奢侈品类订单，收货人手机与本人手机不一致"),
    FQZ_RULE_52(52,"该单为轻奢侈品类订单，收货人手机与历史订单收货人手机相同，收货人姓名不同"),
    FQZ_RULE_53(53,"该单为轻奢侈品类订单，收货人手机与历史订单收货人手机相同，订单账号不同"),
    FQZ_RULE_54(54,"客户为非工薪转工薪后首次交易下单"),
    FQZ_RULE_55(55,"该单为首次下3C类订单，收货地址与历史单据收货地址相似");


    FqzRuleEnum(Integer code,String name){
        this.code = code;
        this.name = name;
    }

    private Integer code;
    private String name;

    public Integer getCode() {
        return code;
    }

    public void setCode(Integer code) {
        this.code = code;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public static String getName(Integer code){
        for(FqzRuleEnum c: FqzRuleEnum.values()){
            if(c.getCode()==code){
                return c.getName();
            }
        }
        return null;
    }
}
